sbourdelin/linux/include/dt-bindings/pinctrl/stm32f4-pinfunc.h
#ifndef _DT_BINDINGS_STM32F4_PINFUNC_H
#define _DT_BINDINGS_STM32F4_PINFUNC_H

#define STM32F4_PA0_FUNC_GPIO 0x0
#define STM32F4_PA0_FUNC_TIM2_CH1_TIM2_ETR 0x2
#define STM32F4_PA0_FUNC_TIM5_CH1 0x3
#define STM32F4_PA0_FUNC_TIM8_ETR 0x4
#define STM32F4_PA0_FUNC_USART2_CTS 0x8
#define STM32F4_PA0_FUNC_UART4_TX 0x9
#define STM32F4_PA0_FUNC_ETH_MII_CRS 0xc
#define STM32F4_PA0_FUNC_EVENTOUT 0x10
#define STM32F4_PA0_FUNC_ANALOG 0x11

#define STM32F4_PA1_FUNC_GPIO 0x100
#define STM32F4_PA1_FUNC_TIM2_CH2 0x102
#define STM32F4_PA1_FUNC_TIM5_CH2 0x103
#define STM32F4_PA1_FUNC_USART2_RTS 0x108
#define STM32F4_PA1_FUNC_UART4_RX 0x109
#define STM32F469_PA1_FUNC_QUADSPI_BK1_IO3 0x10a
#define STM32F4_PA1_FUNC_ETH_MII_RX_CLK_ETH_RMII_REF_CLK 0x10c
#define STM32F469_PA1_FUNC_LCD_R2 0x10f
#define STM32F4_PA1_FUNC_EVENTOUT 0x110
#define STM32F4_PA1_FUNC_ANALOG 0x111

#define STM32F4_PA2_FUNC_GPIO 0x200
#define STM32F4_PA2_FUNC_TIM2_CH3 0x202
#define STM32F4_PA2_FUNC_TIM5_CH3 0x203
#define STM32F4_PA2_FUNC_TIM9_CH1 0x204
#define STM32F4_PA2_FUNC_USART2_TX 0x208
#define STM32F4_PA2_FUNC_ETH_MDIO 0x20c
#define STM32F469_PA2_FUNC_LCD_R1 0x20f
#define STM32F4_PA2_FUNC_EVENTOUT 0x210
#define STM32F4_PA2_FUNC_ANALOG 0x211

#define STM32F4_PA3_FUNC_GPIO 0x300
#define STM32F4_PA3_FUNC_TIM2_CH4 0x302
#define STM32F4_PA3_FUNC_TIM5_CH4 0x303
#define STM32F4_PA3_FUNC_TIM9_CH2 0x304
#define STM32F4_PA3_FUNC_USART2_RX 0x308
#define STM32F469_PA3_FUNC_LCD_B2 0x30a
#define STM32F4_PA3_FUNC_OTG_HS_ULPI_D0 0x30b
#define STM32F4_PA3_FUNC_ETH_MII_COL 0x30c
#define STM32F4_PA3_FUNC_LCD_B5 0x30f
#define STM32F4_PA3_FUNC_EVENTOUT 0x310
#define STM32F4_PA3_FUNC_ANALOG 0x311

#define STM32F4_PA4_FUNC_GPIO 0x400
#define STM32F4_PA4_FUNC_SPI1_NSS 0x406
#define STM32F4_PA4_FUNC_SPI3_NSS_I2S3_WS 0x407
#define STM32F4_PA4_FUNC_USART2_CK 0x408
#define STM32F4_PA4_FUNC_OTG_HS_SOF 0x40d
#define STM32F4_PA4_FUNC_DCMI_HSYNC 0x40e
#define STM32F4_PA4_FUNC_LCD_VSYNC 0x40f
#define STM32F4_PA4_FUNC_EVENTOUT 0x410
#define STM32F4_PA4_FUNC_ANALOG 0x411

#define STM32F4_PA5_FUNC_GPIO 0x500
#define STM32F4_PA5_FUNC_TIM2_CH1_TIM2_ETR 0x502
#define STM32F4_PA5_FUNC_TIM8_CH1N 0x504
#define STM32F4_PA5_FUNC_SPI1_SCK 0x506
#define STM32F4_PA5_FUNC_OTG_HS_ULPI_CK 0x50b
#define STM32F469_PA5_FUNC_LCD_R4 0x50f
#define STM32F4_PA5_FUNC_EVENTOUT 0x510
#define STM32F4_PA5_FUNC_ANALOG 0x511

#define STM32F4_PA6_FUNC_GPIO 0x600
#define STM32F4_PA6_FUNC_TIM1_BKIN 0x602
#define STM32F4_PA6_FUNC_TIM3_CH1 0x603
#define STM32F4_PA6_FUNC_TIM8_BKIN 0x604
#define STM32F4_PA6_FUNC_SPI1_MISO 0x606
#define STM32F4_PA6_FUNC_TIM13_CH1 0x60a
#define STM32F4_PA6_FUNC_DCMI_PIXCLK 0x60e
#define STM32F4_PA6_FUNC_LCD_G2 0x60f
#define STM32F4_PA6_FUNC_EVENTOUT 0x610
#define STM32F4_PA6_FUNC_ANALOG 0x611

#define STM32F4_PA7_FUNC_GPIO 0x700
#define STM32F4_PA7_FUNC_TIM1_CH1N 0x702
#define STM32F4_PA7_FUNC_TIM3_CH2 0x703
#define STM32F4_PA7_FUNC_TIM8_CH1N 0x704
#define STM32F4_PA7_FUNC_SPI1_MOSI 0x706
#define STM32F4_PA7_FUNC_TIM14_CH1 0x70a
#define STM32F469_PA7_FUNC_QUADSPI_CLK 0x70b
#define STM32F4_PA7_FUNC_ETH_MII_RX_DV_ETH_RMII_CRS_DV 0x70c
#define STM32F469_PA7_FUNC_FMC_SDNWE 0x70d
#define STM32F4_PA7_FUNC_EVENTOUT 0x710
#define STM32F4_PA7_FUNC_ANALOG 0x711

#define STM32F4_PA8_FUNC_GPIO 0x800
#define STM32F4_PA8_FUNC_MCO1 0x801
#define STM32F4_PA8_FUNC_TIM1_CH1 0x802
#define STM32F4_PA8_FUNC_I2C3_SCL 0x805
#define STM32F4_PA8_FUNC_USART1_CK 0x808
#define STM32F4_PA8_FUNC_OTG_FS_SOF 0x80b
#define STM32F4_PA8_FUNC_LCD_R6 0x80f
#define STM32F4_PA8_FUNC_EVENTOUT 0x810
#define STM32F4_PA8_FUNC_ANALOG 0x811

#define STM32F4_PA9_FUNC_GPIO 0x900
#define STM32F4_PA9_FUNC_TIM1_CH2 0x902
#define STM32F4_PA9_FUNC_I2C3_SMBA 0x905
#define STM32F469_PA9_FUNC_SPI2_SCK_I2S2_CK 0x906
#define STM32F4_PA9_FUNC_USART1_TX 0x908
#define STM32F4_PA9_FUNC_DCMI_D0 0x90e
#define STM32F4_PA9_FUNC_EVENTOUT 0x910
#define STM32F4_PA9_FUNC_ANALOG 0x911

#define STM32F4_PA10_FUNC_GPIO 0xa00
#define STM32F4_PA10_FUNC_TIM1_CH3 0xa02
#define STM32F4_PA10_FUNC_USART1_RX 0xa08
#define STM32F4_PA10_FUNC_OTG_FS_ID 0xa0b
#define STM32F4_PA10_FUNC_DCMI_D1 0xa0e
#define STM32F4_PA10_FUNC_EVENTOUT 0xa10
#define STM32F4_PA10_FUNC_ANALOG 0xa11

#define STM32F4_PA11_FUNC_GPIO 0xb00
#define STM32F4_PA11_FUNC_TIM1_CH4 0xb02
#define STM32F4_PA11_FUNC_USART1_CTS 0xb08
#define STM32F4_PA11_FUNC_CAN1_RX 0xb0a
#define STM32F4_PA11_FUNC_OTG_FS_DM 0xb0b
#define STM32F4_PA11_FUNC_LCD_R4 0xb0f
#define STM32F4_PA11_FUNC_EVENTOUT 0xb10
#define STM32F4_PA11_FUNC_ANALOG 0xb11

#define STM32F4_PA12_FUNC_GPIO 0xc00
#define STM32F4_PA12_FUNC_TIM1_ETR 0xc02
#define STM32F4_PA12_FUNC_USART1_RTS 0xc08
#define STM32F4_PA12_FUNC_CAN1_TX 0xc0a
#define STM32F4_PA12_FUNC_OTG_FS_DP 0xc0b
#define STM32F4_PA12_FUNC_LCD_R5 0xc0f
#define STM32F4_PA12_FUNC_EVENTOUT 0xc10
#define STM32F4_PA12_FUNC_ANALOG 0xc11

#define STM32F4_PA13_FUNC_GPIO 0xd00
#define STM32F4_PA13_FUNC_JTMS_SWDIO 0xd01
#define STM32F4_PA13_FUNC_EVENTOUT 0xd10
#define STM32F4_PA13_FUNC_ANALOG 0xd11

#define STM32F4_PA14_FUNC_GPIO 0xe00
#define STM32F4_PA14_FUNC_JTCK_SWCLK 0xe01
#define STM32F4_PA14_FUNC_EVENTOUT 0xe10
#define STM32F4_PA14_FUNC_ANALOG 0xe11

#define STM32F4_PA15_FUNC_GPIO 0xf00
#define STM32F4_PA15_FUNC_JTDI 0xf01
#define STM32F4_PA15_FUNC_TIM2_CH1_TIM2_ETR 0xf02
#define STM32F4_PA15_FUNC_SPI1_NSS 0xf06
#define STM32F4_PA15_FUNC_SPI3_NSS_I2S3_WS 0xf07
#define STM32F4_PA15_FUNC_EVENTOUT 0xf10
#define STM32F4_PA15_FUNC_ANALOG 0xf11



#define STM32F4_PB0_FUNC_GPIO 0x1000
#define STM32F4_PB0_FUNC_TIM1_CH2N 0x1002
#define STM32F4_PB0_FUNC_TIM3_CH3 0x1003
#define STM32F4_PB0_FUNC_TIM8_CH2N 0x1004
#define STM32F4_PB0_FUNC_LCD_R3 0x100a
#define STM32F4_PB0_FUNC_OTG_HS_ULPI_D1 0x100b
#define STM32F4_PB0_FUNC_ETH_MII_RXD2 0x100c
#define STM32F469_PB0_FUNC_LCD_G1 0x100f
#define STM32F4_PB0_FUNC_EVENTOUT 0x1010
#define STM32F4_PB0_FUNC_ANALOG 0x1011

#define STM32F4_PB1_FUNC_GPIO 0x1100
#define STM32F4_PB1_FUNC_TIM1_CH3N 0x1102
#define STM32F4_PB1_FUNC_TIM3_CH4 0x1103
#define STM32F4_PB1_FUNC_TIM8_CH3N 0x1104
#define STM32F4_PB1_FUNC_LCD_R6 0x110a
#define STM32F4_PB1_FUNC_OTG_HS_ULPI_D2 0x110b
#define STM32F4_PB1_FUNC_ETH_MII_RXD3 0x110c
#define STM32F469_PB1_FUNC_LCD_G0 0x110f
#define STM32F4_PB1_FUNC_EVENTOUT 0x1110
#define STM32F4_PB1_FUNC_ANALOG 0x1111

#define STM32F4_PB2_FUNC_GPIO 0x1200
#define STM32F4_PB2_FUNC_EVENTOUT 0x1210
#define STM32F4_PB2_FUNC_ANALOG 0x1211

#define STM32F4_PB3_FUNC_GPIO 0x1300
#define STM32F4_PB3_FUNC_JTDO_TRACESWO 0x1301
#define STM32F4_PB3_FUNC_TIM2_CH2 0x1302
#define STM32F4_PB3_FUNC_SPI1_SCK 0x1306
#define STM32F4_PB3_FUNC_SPI3_SCK_I2S3_CK 0x1307
#define STM32F4_PB3_FUNC_EVENTOUT 0x1310
#define STM32F4_PB3_FUNC_ANALOG 0x1311

