sbourdelin/linux/include/dt-bindings/pinctrl/stm32f4-pinfunc.h
#define STM32F4_PB4_FUNC_GPIO 0x1400
#define STM32F4_PB4_FUNC_NJTRST 0x1401
#define STM32F4_PB4_FUNC_TIM3_CH1 0x1403
#define STM32F4_PB4_FUNC_SPI1_MISO 0x1406
#define STM32F4_PB4_FUNC_SPI3_MISO 0x1407
#define STM32F4_PB4_FUNC_I2S3EXT_SD 0x1408
#define STM32F4_PB4_FUNC_EVENTOUT 0x1410
#define STM32F4_PB4_FUNC_ANALOG 0x1411

#define STM32F4_PB5_FUNC_GPIO 0x1500
#define STM32F4_PB5_FUNC_TIM3_CH2 0x1503
#define STM32F4_PB5_FUNC_I2C1_SMBA 0x1505
#define STM32F4_PB5_FUNC_SPI1_MOSI 0x1506
#define STM32F4_PB5_FUNC_SPI3_MOSI_I2S3_SD 0x1507
#define STM32F4_PB5_FUNC_CAN2_RX 0x150a
#define STM32F4_PB5_FUNC_OTG_HS_ULPI_D7 0x150b
#define STM32F4_PB5_FUNC_ETH_PPS_OUT 0x150c
#define STM32F4_PB5_FUNC_FMC_SDCKE1 0x150d
#define STM32F4_PB5_FUNC_DCMI_D10 0x150e
#define STM32F469_PB5_FUNC_LCD_G7 0x150f
#define STM32F4_PB5_FUNC_EVENTOUT 0x1510
#define STM32F4_PB5_FUNC_ANALOG 0x1511

#define STM32F4_PB6_FUNC_GPIO 0x1600
#define STM32F4_PB6_FUNC_TIM4_CH1 0x1603
#define STM32F4_PB6_FUNC_I2C1_SCL 0x1605
#define STM32F4_PB6_FUNC_USART1_TX 0x1608
#define STM32F4_PB6_FUNC_CAN2_TX 0x160a
#define STM32F469_PB6_FUNC_QUADSPI_BK1_NCS 0x160b
#define STM32F4_PB6_FUNC_FMC_SDNE1 0x160d
#define STM32F4_PB6_FUNC_DCMI_D5 0x160e
#define STM32F4_PB6_FUNC_EVENTOUT 0x1610
#define STM32F4_PB6_FUNC_ANALOG 0x1611

#define STM32F4_PB7_FUNC_GPIO 0x1700
#define STM32F4_PB7_FUNC_TIM4_CH2 0x1703
#define STM32F4_PB7_FUNC_I2C1_SDA 0x1705
#define STM32F4_PB7_FUNC_USART1_RX 0x1708
#define STM32F4_PB7_FUNC_FMC_NL 0x170d
#define STM32F4_PB7_FUNC_DCMI_VSYNC 0x170e
#define STM32F4_PB7_FUNC_EVENTOUT 0x1710
#define STM32F4_PB7_FUNC_ANALOG 0x1711

#define STM32F4_PB8_FUNC_GPIO 0x1800
#define STM32F4_PB8_FUNC_TIM4_CH3 0x1803
#define STM32F4_PB8_FUNC_TIM10_CH1 0x1804
#define STM32F4_PB8_FUNC_I2C1_SCL 0x1805
#define STM32F4_PB8_FUNC_CAN1_RX 0x180a
#define STM32F4_PB8_FUNC_ETH_MII_TXD3 0x180c
#define STM32F4_PB8_FUNC_SDIO_D4 0x180d
#define STM32F4_PB8_FUNC_DCMI_D6 0x180e
#define STM32F4_PB8_FUNC_LCD_B6 0x180f
#define STM32F4_PB8_FUNC_EVENTOUT 0x1810
#define STM32F4_PB8_FUNC_ANALOG 0x1811

#define STM32F4_PB9_FUNC_GPIO 0x1900
#define STM32F4_PB9_FUNC_TIM4_CH4 0x1903
#define STM32F4_PB9_FUNC_TIM11_CH1 0x1904
#define STM32F4_PB9_FUNC_I2C1_SDA 0x1905
#define STM32F4_PB9_FUNC_SPI2_NSS_I2S2_WS 0x1906
#define STM32F4_PB9_FUNC_CAN1_TX 0x190a
#define STM32F4_PB9_FUNC_SDIO_D5 0x190d
#define STM32F4_PB9_FUNC_DCMI_D7 0x190e
#define STM32F4_PB9_FUNC_LCD_B7 0x190f
#define STM32F4_PB9_FUNC_EVENTOUT 0x1910
#define STM32F4_PB9_FUNC_ANALOG 0x1911

#define STM32F4_PB10_FUNC_GPIO 0x1a00
#define STM32F4_PB10_FUNC_TIM2_CH3 0x1a02
#define STM32F4_PB10_FUNC_I2C2_SCL 0x1a05
#define STM32F4_PB10_FUNC_SPI2_SCK_I2S2_CK 0x1a06
#define STM32F4_PB10_FUNC_USART3_TX 0x1a08
#define STM32F469_PB10_FUNC_QUADSPI_BK1_NCS 0x1a0a
#define STM32F4_PB10_FUNC_OTG_HS_ULPI_D3 0x1a0b
#define STM32F4_PB10_FUNC_ETH_MII_RX_ER 0x1a0c
#define STM32F4_PB10_FUNC_LCD_G4 0x1a0f
#define STM32F4_PB10_FUNC_EVENTOUT 0x1a10
#define STM32F4_PB10_FUNC_ANALOG 0x1a11

#define STM32F4_PB11_FUNC_GPIO 0x1b00
#define STM32F4_PB11_FUNC_TIM2_CH4 0x1b02
#define STM32F4_PB11_FUNC_I2C2_SDA 0x1b05
#define STM32F4_PB11_FUNC_USART3_RX 0x1b08
#define STM32F4_PB11_FUNC_OTG_HS_ULPI_D4 0x1b0b
#define STM32F4_PB11_FUNC_ETH_MII_TX_EN_ETH_RMII_TX_EN 0x1b0c
#define STM32F469_PB11_FUNC_DSIHOST_TE 0x1b0e
#define STM32F4_PB11_FUNC_LCD_G5 0x1b0f
#define STM32F4_PB11_FUNC_EVENTOUT 0x1b10
#define STM32F4_PB11_FUNC_ANALOG 0x1b11

#define STM32F4_PB12_FUNC_GPIO 0x1c00
#define STM32F4_PB12_FUNC_TIM1_BKIN 0x1c02
#define STM32F4_PB12_FUNC_I2C2_SMBA 0x1c05
#define STM32F4_PB12_FUNC_SPI2_NSS_I2S2_WS 0x1c06
#define STM32F4_PB12_FUNC_USART3_CK 0x1c08
#define STM32F4_PB12_FUNC_CAN2_RX 0x1c0a
#define STM32F4_PB12_FUNC_OTG_HS_ULPI_D5 0x1c0b
#define STM32F4_PB12_FUNC_ETH_MII_TXD0_ETH_RMII_TXD0 0x1c0c
#define STM32F4_PB12_FUNC_OTG_HS_ID 0x1c0d
#define STM32F4_PB12_FUNC_EVENTOUT 0x1c10
#define STM32F4_PB12_FUNC_ANALOG 0x1c11

#define STM32F4_PB13_FUNC_GPIO 0x1d00
#define STM32F4_PB13_FUNC_TIM1_CH1N 0x1d02
#define STM32F4_PB13_FUNC_SPI2_SCK_I2S2_CK 0x1d06
#define STM32F4_PB13_FUNC_USART3_CTS 0x1d08
#define STM32F4_PB13_FUNC_CAN2_TX 0x1d0a
#define STM32F4_PB13_FUNC_OTG_HS_ULPI_D6 0x1d0b
#define STM32F4_PB13_FUNC_ETH_MII_TXD1_ETH_RMII_TXD1 0x1d0c
#define STM32F4_PB13_FUNC_EVENTOUT 0x1d10
#define STM32F4_PB13_FUNC_ANALOG 0x1d11

#define STM32F4_PB14_FUNC_GPIO 0x1e00
#define STM32F4_PB14_FUNC_TIM1_CH2N 0x1e02
#define STM32F4_PB14_FUNC_TIM8_CH2N 0x1e04
#define STM32F4_PB14_FUNC_SPI2_MISO 0x1e06
#define STM32F4_PB14_FUNC_I2S2EXT_SD 0x1e07
#define STM32F4_PB14_FUNC_USART3_RTS 0x1e08
#define STM32F4_PB14_FUNC_TIM12_CH1 0x1e0a
#define STM32F4_PB14_FUNC_OTG_HS_DM 0x1e0d
#define STM32F4_PB14_FUNC_EVENTOUT 0x1e10
#define STM32F4_PB14_FUNC_ANALOG 0x1e11

#define STM32F4_PB15_FUNC_GPIO 0x1f00
#define STM32F4_PB15_FUNC_RTC_REFIN 0x1f01
#define STM32F4_PB15_FUNC_TIM1_CH3N 0x1f02
#define STM32F4_PB15_FUNC_TIM8_CH3N 0x1f04
#define STM32F4_PB15_FUNC_SPI2_MOSI_I2S2_SD 0x1f06
#define STM32F4_PB15_FUNC_TIM12_CH2 0x1f0a
#define STM32F4_PB15_FUNC_OTG_HS_DP 0x1f0d
#define STM32F4_PB15_FUNC_EVENTOUT 0x1f10
#define STM32F4_PB15_FUNC_ANALOG 0x1f11



#define STM32F4_PC0_FUNC_GPIO 0x2000
#define STM32F4_PC0_FUNC_OTG_HS_ULPI_STP 0x200b
#define STM32F4_PC0_FUNC_FMC_SDNWE 0x200d
#define STM32F469_PC0_FUNC_LCD_R5 0x200f
#define STM32F4_PC0_FUNC_EVENTOUT 0x2010
#define STM32F4_PC0_FUNC_ANALOG 0x2011

#define STM32F4_PC1_FUNC_GPIO 0x2100
#define STM32F469_PC1_FUNC_TRACED0 0x2101
#define STM32F469_PC1_FUNC_SPI2_MOSI_I2S2_SD 0x2106
#define STM32F469_PC1_FUNC_SAI1_SD_A 0x2107
#define STM32F4_PC1_FUNC_ETH_MDC 0x210c
#define STM32F4_PC1_FUNC_EVENTOUT 0x2110
#define STM32F4_PC1_FUNC_ANALOG 0x2111

#define STM32F4_PC2_FUNC_GPIO 0x2200
#define STM32F4_PC2_FUNC_SPI2_MISO 0x2206
#define STM32F4_PC2_FUNC_I2S2EXT_SD 0x2207
#define STM32F4_PC2_FUNC_OTG_HS_ULPI_DIR 0x220b
#define STM32F4_PC2_FUNC_ETH_MII_TXD2 0x220c
#define STM32F4_PC2_FUNC_FMC_SDNE0 0x220d
#define STM32F4_PC2_FUNC_EVENTOUT 0x2210
#define STM32F4_PC2_FUNC_ANALOG 0x2211

#define STM32F4_PC3_FUNC_GPIO 0x2300
#define STM32F4_PC3_FUNC_SPI2_MOSI_I2S2_SD 0x2306
#define STM32F4_PC3_FUNC_OTG_HS_ULPI_NXT 0x230b
#define STM32F4_PC3_FUNC_ETH_MII_TX_CLK 0x230c
#define STM32F4_PC3_FUNC_FMC_SDCKE0 0x230d
#define STM32F4_PC3_FUNC_EVENTOUT 0x2310
#define STM32F4_PC3_FUNC_ANALOG 0x2311

#define STM32F4_PC4_FUNC_GPIO 0x2400
#define STM32F4_PC4_FUNC_ETH_MII_RXD0_ETH_RMII_RXD0 0x240c
#define STM32F469_PC4_FUNC_FMC_SDNE0 0x240d
#define STM32F4_PC4_FUNC_EVENTOUT 0x2410
#define STM32F4_PC4_FUNC_ANALOG 0x2411

