sbourdelin/linux/include/dt-bindings/pinctrl/stm32f4-pinfunc.h
#define STM32F4_PC5_FUNC_GPIO 0x2500
#define STM32F4_PC5_FUNC_ETH_MII_RXD1_ETH_RMII_RXD1 0x250c
#define STM32F469_PC5_FUNC_FMC_SDCKE0 0x250d
#define STM32F4_PC5_FUNC_EVENTOUT 0x2510
#define STM32F4_PC5_FUNC_ANALOG 0x2511

#define STM32F4_PC6_FUNC_GPIO 0x2600
#define STM32F4_PC6_FUNC_TIM3_CH1 0x2603
#define STM32F4_PC6_FUNC_TIM8_CH1 0x2604
#define STM32F4_PC6_FUNC_I2S2_MCK 0x2606
#define STM32F4_PC6_FUNC_USART6_TX 0x2609
#define STM32F4_PC6_FUNC_SDIO_D6 0x260d
#define STM32F4_PC6_FUNC_DCMI_D0 0x260e
#define STM32F4_PC6_FUNC_LCD_HSYNC 0x260f
#define STM32F4_PC6_FUNC_EVENTOUT 0x2610
#define STM32F4_PC6_FUNC_ANALOG 0x2611

#define STM32F4_PC7_FUNC_GPIO 0x2700
#define STM32F4_PC7_FUNC_TIM3_CH2 0x2703
#define STM32F4_PC7_FUNC_TIM8_CH2 0x2704
#define STM32F4_PC7_FUNC_I2S3_MCK 0x2707
#define STM32F4_PC7_FUNC_USART6_RX 0x2709
#define STM32F4_PC7_FUNC_SDIO_D7 0x270d
#define STM32F4_PC7_FUNC_DCMI_D1 0x270e
#define STM32F4_PC7_FUNC_LCD_G6 0x270f
#define STM32F4_PC7_FUNC_EVENTOUT 0x2710
#define STM32F4_PC7_FUNC_ANALOG 0x2711

#define STM32F4_PC8_FUNC_GPIO 0x2800
#define STM32F469_PC8_FUNC_TRACED1 0x2801
#define STM32F4_PC8_FUNC_TIM3_CH3 0x2803
#define STM32F4_PC8_FUNC_TIM8_CH3 0x2804
#define STM32F4_PC8_FUNC_USART6_CK 0x2809
#define STM32F4_PC8_FUNC_SDIO_D0 0x280d
#define STM32F4_PC8_FUNC_DCMI_D2 0x280e
#define STM32F4_PC8_FUNC_EVENTOUT 0x2810
#define STM32F4_PC8_FUNC_ANALOG 0x2811

#define STM32F4_PC9_FUNC_GPIO 0x2900
#define STM32F4_PC9_FUNC_MCO2 0x2901
#define STM32F4_PC9_FUNC_TIM3_CH4 0x2903
#define STM32F4_PC9_FUNC_TIM8_CH4 0x2904
#define STM32F4_PC9_FUNC_I2C3_SDA 0x2905
#define STM32F4_PC9_FUNC_I2S_CKIN 0x2906
#define STM32F469_PC9_FUNC_QUADSPI_BK1_IO0 0x290a
#define STM32F4_PC9_FUNC_SDIO_D1 0x290d
#define STM32F4_PC9_FUNC_DCMI_D3 0x290e
#define STM32F4_PC9_FUNC_EVENTOUT 0x2910
#define STM32F4_PC9_FUNC_ANALOG 0x2911

#define STM32F4_PC10_FUNC_GPIO 0x2a00
#define STM32F4_PC10_FUNC_SPI3_SCK_I2S3_CK 0x2a07
#define STM32F4_PC10_FUNC_USART3_TX 0x2a08
#define STM32F4_PC10_FUNC_UART4_TX 0x2a09
#define STM32F469_PC10_FUNC_QUADSPI_BK1_IO1 0x2a0a
#define STM32F4_PC10_FUNC_SDIO_D2 0x2a0d
#define STM32F4_PC10_FUNC_DCMI_D8 0x2a0e
#define STM32F4_PC10_FUNC_LCD_R2 0x2a0f
#define STM32F4_PC10_FUNC_EVENTOUT 0x2a10
#define STM32F4_PC10_FUNC_ANALOG 0x2a11

#define STM32F4_PC11_FUNC_GPIO 0x2b00
#define STM32F4_PC11_FUNC_I2S3EXT_SD 0x2b06
#define STM32F4_PC11_FUNC_SPI3_MISO 0x2b07
#define STM32F4_PC11_FUNC_USART3_RX 0x2b08
#define STM32F4_PC11_FUNC_UART4_RX 0x2b09
#define STM32F469_PC11_FUNC_QUADSPI_BK2_NCS 0x2b0a
#define STM32F4_PC11_FUNC_SDIO_D3 0x2b0d
#define STM32F4_PC11_FUNC_DCMI_D4 0x2b0e
#define STM32F4_PC11_FUNC_EVENTOUT 0x2b10
#define STM32F4_PC11_FUNC_ANALOG 0x2b11

#define STM32F4_PC12_FUNC_GPIO 0x2c00
#define STM32F469_PC12_FUNC_TRACED3 0x2c01
#define STM32F4_PC12_FUNC_SPI3_MOSI_I2S3_SD 0x2c07
#define STM32F4_PC12_FUNC_USART3_CK 0x2c08
#define STM32F4_PC12_FUNC_UART5_TX 0x2c09
#define STM32F4_PC12_FUNC_SDIO_CK 0x2c0d
#define STM32F4_PC12_FUNC_DCMI_D9 0x2c0e
#define STM32F4_PC12_FUNC_EVENTOUT 0x2c10
#define STM32F4_PC12_FUNC_ANALOG 0x2c11

#define STM32F4_PC13_FUNC_GPIO 0x2d00
#define STM32F4_PC13_FUNC_EVENTOUT 0x2d10
#define STM32F4_PC13_FUNC_ANALOG 0x2d11

#define STM32F4_PC14_FUNC_GPIO 0x2e00
#define STM32F4_PC14_FUNC_EVENTOUT 0x2e10
#define STM32F4_PC14_FUNC_ANALOG 0x2e11

#define STM32F4_PC15_FUNC_GPIO 0x2f00
#define STM32F4_PC15_FUNC_EVENTOUT 0x2f10
#define STM32F4_PC15_FUNC_ANALOG 0x2f11



#define STM32F4_PD0_FUNC_GPIO 0x3000
#define STM32F4_PD0_FUNC_CAN1_RX 0x300a
#define STM32F4_PD0_FUNC_FMC_D2 0x300d
#define STM32F4_PD0_FUNC_EVENTOUT 0x3010
#define STM32F4_PD0_FUNC_ANALOG 0x3011

#define STM32F4_PD1_FUNC_GPIO 0x3100
#define STM32F4_PD1_FUNC_CAN1_TX 0x310a
#define STM32F4_PD1_FUNC_FMC_D3 0x310d
#define STM32F4_PD1_FUNC_EVENTOUT 0x3110
#define STM32F4_PD1_FUNC_ANALOG 0x3111

#define STM32F4_PD2_FUNC_GPIO 0x3200
#define STM32F469_PD2_FUNC_TRACED2 0x3201
#define STM32F4_PD2_FUNC_TIM3_ETR 0x3203
#define STM32F4_PD2_FUNC_UART5_RX 0x3209
#define STM32F4_PD2_FUNC_SDIO_CMD 0x320d
#define STM32F4_PD2_FUNC_DCMI_D11 0x320e
#define STM32F4_PD2_FUNC_EVENTOUT 0x3210
#define STM32F4_PD2_FUNC_ANALOG 0x3211

#define STM32F4_PD3_FUNC_GPIO 0x3300
#define STM32F4_PD3_FUNC_SPI2_SCK_I2S2_CK 0x3306
#define STM32F4_PD3_FUNC_USART2_CTS 0x3308
#define STM32F4_PD3_FUNC_FMC_CLK 0x330d
#define STM32F4_PD3_FUNC_DCMI_D5 0x330e
#define STM32F4_PD3_FUNC_LCD_G7 0x330f
#define STM32F4_PD3_FUNC_EVENTOUT 0x3310
#define STM32F4_PD3_FUNC_ANALOG 0x3311

#define STM32F4_PD4_FUNC_GPIO 0x3400
#define STM32F4_PD4_FUNC_USART2_RTS 0x3408
#define STM32F4_PD4_FUNC_FMC_NOE 0x340d
#define STM32F4_PD4_FUNC_EVENTOUT 0x3410
#define STM32F4_PD4_FUNC_ANALOG 0x3411

#define STM32F4_PD5_FUNC_GPIO 0x3500
#define STM32F4_PD5_FUNC_USART2_TX 0x3508
#define STM32F4_PD5_FUNC_FMC_NWE 0x350d
#define STM32F4_PD5_FUNC_EVENTOUT 0x3510
#define STM32F4_PD5_FUNC_ANALOG 0x3511

#define STM32F4_PD6_FUNC_GPIO 0x3600
#define STM32F4_PD6_FUNC_SPI3_MOSI_I2S3_SD 0x3606
#define STM32F4_PD6_FUNC_SAI1_SD_A 0x3607
#define STM32F4_PD6_FUNC_USART2_RX 0x3608
#define STM32F4_PD6_FUNC_FMC_NWAIT 0x360d
#define STM32F4_PD6_FUNC_DCMI_D10 0x360e
#define STM32F4_PD6_FUNC_LCD_B2 0x360f
#define STM32F4_PD6_FUNC_EVENTOUT 0x3610
#define STM32F4_PD6_FUNC_ANALOG 0x3611

#define STM32F4_PD7_FUNC_GPIO 0x3700
#define STM32F4_PD7_FUNC_USART2_CK 0x3708
#define STM32F429_PD7_FUNC_FMC_NE1_FMC_NCE2 0x370d
#define STM32F469_PD7_FUNC_FMC_NE1 0x370d
#define STM32F4_PD7_FUNC_EVENTOUT 0x3710
#define STM32F4_PD7_FUNC_ANALOG 0x3711

#define STM32F4_PD8_FUNC_GPIO 0x3800
#define STM32F4_PD8_FUNC_USART3_TX 0x3808
#define STM32F4_PD8_FUNC_FMC_D13 0x380d
#define STM32F4_PD8_FUNC_EVENTOUT 0x3810
#define STM32F4_PD8_FUNC_ANALOG 0x3811

#define STM32F4_PD9_FUNC_GPIO 0x3900
#define STM32F4_PD9_FUNC_USART3_RX 0x3908
#define STM32F4_PD9_FUNC_FMC_D14 0x390d
#define STM32F4_PD9_FUNC_EVENTOUT 0x3910
#define STM32F4_PD9_FUNC_ANALOG 0x3911

#define STM32F4_PD10_FUNC_GPIO 0x3a00
#define STM32F4_PD10_FUNC_USART3_CK 0x3a08
#define STM32F4_PD10_FUNC_FMC_D15 0x3a0d
#define STM32F4_PD10_FUNC_LCD_B3 0x3a0f
#define STM32F4_PD10_FUNC_EVENTOUT 0x3a10
#define STM32F4_PD10_FUNC_ANALOG 0x3a11

#define STM32F4_PD11_FUNC_GPIO 0x3b00
#define STM32F4_PD11_FUNC_USART3_CTS 0x3b08
#define STM32F469_PD11_FUNC_QUADSPI_BK1_IO0 0x3b0a
#define STM32F429_PD11_FUNC_FMC_A16 0x3b0d
#define STM32F469_PD11_FUNC_FMC_A16_FMC_CLE 0x3b0d
#define STM32F4_PD11_FUNC_EVENTOUT 0x3b10
#define STM32F4_PD11_FUNC_ANALOG 0x3b11

#define STM32F4_PD12_FUNC_GPIO 0x3c00
#define STM32F4_PD12_FUNC_TIM4_CH1 0x3c03
#define STM32F4_PD12_FUNC_USART3_RTS 0x3c08
#define STM32F469_PD12_FUNC_QUADSPI_BK1_IO1 0x3c0a
#define STM32F429_PD12_FUNC_FMC_A17 0x3c0d
#define STM32F469_PD12_FUNC_FMC_A17_FMC_ALE 0x3c0d
#define STM32F4_PD12_FUNC_EVENTOUT 0x3c10
#define STM32F4_PD12_FUNC_ANALOG 0x3c11

#define STM32F4_PD13_FUNC_GPIO 0x3d00
#define STM32F4_PD13_FUNC_TIM4_CH2 0x3d03
#define STM32F469_PD13_FUNC_QUADSPI_BK1_IO3 0x3d0a
#define STM32F4_PD13_FUNC_FMC_A18 0x3d0d
#define STM32F4_PD13_FUNC_EVENTOUT 0x3d10
#define STM32F4_PD13_FUNC_ANALOG 0x3d11

#define STM32F4_PD14_FUNC_GPIO 0x3e00
#define STM32F4_PD14_FUNC_TIM4_CH3 0x3e03
#define STM32F4_PD14_FUNC_FMC_D0 0x3e0d
#define STM32F4_PD14_FUNC_EVENTOUT 0x3e10
#define STM32F4_PD14_FUNC_ANALOG 0x3e11

#define STM32F4_PD15_FUNC_GPIO 0x3f00
#define STM32F4_PD15_FUNC_TIM4_CH4 0x3f03
#define STM32F4_PD15_FUNC_FMC_D1 0x3f0d
#define STM32F4_PD15_FUNC_EVENTOUT 0x3f10
#define STM32F4_PD15_FUNC_ANALOG 0x3f11



#define STM32F4_PE0_FUNC_GPIO 0x4000
#define STM32F4_PE0_FUNC_TIM4_ETR 0x4003
#define STM32F4_PE0_FUNC_UART8_RX 0x4009
#define STM32F4_PE0_FUNC_FMC_NBL0 0x400d
#define STM32F4_PE0_FUNC_DCMI_D2 0x400e
#define STM32F4_PE0_FUNC_EVENTOUT 0x4010
#define STM32F4_PE0_FUNC_ANALOG 0x4011

#define STM32F4_PE1_FUNC_GPIO 0x4100
#define STM32F4_PE1_FUNC_UART8_TX 0x4109
#define STM32F4_PE1_FUNC_FMC_NBL1 0x410d
#define STM32F4_PE1_FUNC_DCMI_D3 0x410e
#define STM32F4_PE1_FUNC_EVENTOUT 0x4110
#define STM32F4_PE1_FUNC_ANALOG 0x4111

#define STM32F4_PE2_FUNC_GPIO 0x4200
#define STM32F4_PE2_FUNC_TRACECLK 0x4201
#define STM32F4_PE2_FUNC_SPI4_SCK 0x4206
#define STM32F4_PE2_FUNC_SAI1_MCLK_A 0x4207
#define STM32F469_PE2_FUNC_QUADSPI_BK1_IO2 0x420a
#define STM32F4_PE2_FUNC_ETH_MII_TXD3 0x420c
#define STM32F4_PE2_FUNC_FMC_A23 0x420d
#define STM32F4_PE2_FUNC_EVENTOUT 0x4210
#define STM32F4_PE2_FUNC_ANALOG 0x4211

