sbourdelin/linux/include/dt-bindings/pinctrl/stm32f4-pinfunc.h
#define STM32F4_PE3_FUNC_GPIO 0x4300
#define STM32F4_PE3_FUNC_TRACED0 0x4301
#define STM32F4_PE3_FUNC_SAI1_SD_B 0x4307
#define STM32F4_PE3_FUNC_FMC_A19 0x430d
#define STM32F4_PE3_FUNC_EVENTOUT 0x4310
#define STM32F4_PE3_FUNC_ANALOG 0x4311

#define STM32F4_PE4_FUNC_GPIO 0x4400
#define STM32F4_PE4_FUNC_TRACED1 0x4401
#define STM32F4_PE4_FUNC_SPI4_NSS 0x4406
#define STM32F4_PE4_FUNC_SAI1_FS_A 0x4407
#define STM32F4_PE4_FUNC_FMC_A20 0x440d
#define STM32F4_PE4_FUNC_DCMI_D4 0x440e
#define STM32F4_PE4_FUNC_LCD_B0 0x440f
#define STM32F4_PE4_FUNC_EVENTOUT 0x4410
#define STM32F4_PE4_FUNC_ANALOG 0x4411

#define STM32F4_PE5_FUNC_GPIO 0x4500
#define STM32F4_PE5_FUNC_TRACED2 0x4501
#define STM32F4_PE5_FUNC_TIM9_CH1 0x4504
#define STM32F4_PE5_FUNC_SPI4_MISO 0x4506
#define STM32F4_PE5_FUNC_SAI1_SCK_A 0x4507
#define STM32F4_PE5_FUNC_FMC_A21 0x450d
#define STM32F4_PE5_FUNC_DCMI_D6 0x450e
#define STM32F4_PE5_FUNC_LCD_G0 0x450f
#define STM32F4_PE5_FUNC_EVENTOUT 0x4510
#define STM32F4_PE5_FUNC_ANALOG 0x4511

#define STM32F4_PE6_FUNC_GPIO 0x4600
#define STM32F4_PE6_FUNC_TRACED3 0x4601
#define STM32F4_PE6_FUNC_TIM9_CH2 0x4604
#define STM32F4_PE6_FUNC_SPI4_MOSI 0x4606
#define STM32F4_PE6_FUNC_SAI1_SD_A 0x4607
#define STM32F4_PE6_FUNC_FMC_A22 0x460d
#define STM32F4_PE6_FUNC_DCMI_D7 0x460e
#define STM32F4_PE6_FUNC_LCD_G1 0x460f
#define STM32F4_PE6_FUNC_EVENTOUT 0x4610
#define STM32F4_PE6_FUNC_ANALOG 0x4611

#define STM32F4_PE7_FUNC_GPIO 0x4700
#define STM32F4_PE7_FUNC_TIM1_ETR 0x4702
#define STM32F4_PE7_FUNC_UART7_RX 0x4709
#define STM32F469_PE7_FUNC_QUADSPI_BK2_IO0 0x470b
#define STM32F4_PE7_FUNC_FMC_D4 0x470d
#define STM32F4_PE7_FUNC_EVENTOUT 0x4710
#define STM32F4_PE7_FUNC_ANALOG 0x4711

#define STM32F4_PE8_FUNC_GPIO 0x4800
#define STM32F4_PE8_FUNC_TIM1_CH1N 0x4802
#define STM32F4_PE8_FUNC_UART7_TX 0x4809
#define STM32F469_PE8_FUNC_QUADSPI_BK2_IO1 0x480b
#define STM32F4_PE8_FUNC_FMC_D5 0x480d
#define STM32F4_PE8_FUNC_EVENTOUT 0x4810
#define STM32F4_PE8_FUNC_ANALOG 0x4811

#define STM32F4_PE9_FUNC_GPIO 0x4900
#define STM32F4_PE9_FUNC_TIM1_CH1 0x4902
#define STM32F469_PE9_FUNC_QUADSPI_BK2_IO2 0x490b
#define STM32F4_PE9_FUNC_FMC_D6 0x490d
#define STM32F4_PE9_FUNC_EVENTOUT 0x4910
#define STM32F4_PE9_FUNC_ANALOG 0x4911

#define STM32F4_PE10_FUNC_GPIO 0x4a00
#define STM32F4_PE10_FUNC_TIM1_CH2N 0x4a02
#define STM32F469_PE10_FUNC_QUADSPI_BK2_IO3 0x4a0b
#define STM32F4_PE10_FUNC_FMC_D7 0x4a0d
#define STM32F4_PE10_FUNC_EVENTOUT 0x4a10
#define STM32F4_PE10_FUNC_ANALOG 0x4a11

#define STM32F4_PE11_FUNC_GPIO 0x4b00
#define STM32F4_PE11_FUNC_TIM1_CH2 0x4b02
#define STM32F4_PE11_FUNC_SPI4_NSS 0x4b06
#define STM32F4_PE11_FUNC_FMC_D8 0x4b0d
#define STM32F4_PE11_FUNC_LCD_G3 0x4b0f
#define STM32F4_PE11_FUNC_EVENTOUT 0x4b10
#define STM32F4_PE11_FUNC_ANALOG 0x4b11

#define STM32F4_PE12_FUNC_GPIO 0x4c00
#define STM32F4_PE12_FUNC_TIM1_CH3N 0x4c02
#define STM32F4_PE12_FUNC_SPI4_SCK 0x4c06
#define STM32F4_PE12_FUNC_FMC_D9 0x4c0d
#define STM32F4_PE12_FUNC_LCD_B4 0x4c0f
#define STM32F4_PE12_FUNC_EVENTOUT 0x4c10
#define STM32F4_PE12_FUNC_ANALOG 0x4c11

#define STM32F4_PE13_FUNC_GPIO 0x4d00
#define STM32F4_PE13_FUNC_TIM1_CH3 0x4d02
#define STM32F4_PE13_FUNC_SPI4_MISO 0x4d06
#define STM32F4_PE13_FUNC_FMC_D10 0x4d0d
#define STM32F4_PE13_FUNC_LCD_DE 0x4d0f
#define STM32F4_PE13_FUNC_EVENTOUT 0x4d10
#define STM32F4_PE13_FUNC_ANALOG 0x4d11

#define STM32F4_PE14_FUNC_GPIO 0x4e00
#define STM32F4_PE14_FUNC_TIM1_CH4 0x4e02
#define STM32F4_PE14_FUNC_SPI4_MOSI 0x4e06
#define STM32F4_PE14_FUNC_FMC_D11 0x4e0d
#define STM32F4_PE14_FUNC_LCD_CLK 0x4e0f
#define STM32F4_PE14_FUNC_EVENTOUT 0x4e10
#define STM32F4_PE14_FUNC_ANALOG 0x4e11

#define STM32F4_PE15_FUNC_GPIO 0x4f00
#define STM32F4_PE15_FUNC_TIM1_BKIN 0x4f02
#define STM32F4_PE15_FUNC_FMC_D12 0x4f0d
#define STM32F4_PE15_FUNC_LCD_R7 0x4f0f
#define STM32F4_PE15_FUNC_EVENTOUT 0x4f10
#define STM32F4_PE15_FUNC_ANALOG 0x4f11



#define STM32F4_PF0_FUNC_GPIO 0x5000
#define STM32F4_PF0_FUNC_I2C2_SDA 0x5005
#define STM32F4_PF0_FUNC_FMC_A0 0x500d
#define STM32F4_PF0_FUNC_EVENTOUT 0x5010
#define STM32F4_PF0_FUNC_ANALOG 0x5011

#define STM32F4_PF1_FUNC_GPIO 0x5100
#define STM32F4_PF1_FUNC_I2C2_SCL 0x5105
#define STM32F4_PF1_FUNC_FMC_A1 0x510d
#define STM32F4_PF1_FUNC_EVENTOUT 0x5110
#define STM32F4_PF1_FUNC_ANALOG 0x5111

#define STM32F4_PF2_FUNC_GPIO 0x5200
#define STM32F4_PF2_FUNC_I2C2_SMBA 0x5205
#define STM32F4_PF2_FUNC_FMC_A2 0x520d
#define STM32F4_PF2_FUNC_EVENTOUT 0x5210
#define STM32F4_PF2_FUNC_ANALOG 0x5211

#define STM32F4_PF3_FUNC_GPIO 0x5300
#define STM32F4_PF3_FUNC_FMC_A3 0x530d
#define STM32F4_PF3_FUNC_EVENTOUT 0x5310
#define STM32F4_PF3_FUNC_ANALOG 0x5311

#define STM32F4_PF4_FUNC_GPIO 0x5400
#define STM32F4_PF4_FUNC_FMC_A4 0x540d
#define STM32F4_PF4_FUNC_EVENTOUT 0x5410
#define STM32F4_PF4_FUNC_ANALOG 0x5411

#define STM32F4_PF5_FUNC_GPIO 0x5500
#define STM32F4_PF5_FUNC_FMC_A5 0x550d
#define STM32F4_PF5_FUNC_EVENTOUT 0x5510
#define STM32F4_PF5_FUNC_ANALOG 0x5511

#define STM32F4_PF6_FUNC_GPIO 0x5600
#define STM32F4_PF6_FUNC_TIM10_CH1 0x5604
#define STM32F4_PF6_FUNC_SPI5_NSS 0x5606
#define STM32F4_PF6_FUNC_SAI1_SD_B 0x5607
#define STM32F4_PF6_FUNC_UART7_RX 0x5609
#define STM32F469_PF6_FUNC_QUADSPI_BK1_IO3 0x560a
#define STM32F429_PF6_FUNC_FMC_NIORD 0x560d
#define STM32F4_PF6_FUNC_EVENTOUT 0x5610
#define STM32F4_PF6_FUNC_ANALOG 0x5611

#define STM32F4_PF7_FUNC_GPIO 0x5700
#define STM32F4_PF7_FUNC_TIM11_CH1 0x5704
#define STM32F4_PF7_FUNC_SPI5_SCK 0x5706
#define STM32F4_PF7_FUNC_SAI1_MCLK_B 0x5707
#define STM32F4_PF7_FUNC_UART7_TX 0x5709
#define STM32F469_PF7_FUNC_QUADSPI_BK1_IO2 0x570a
#define STM32F429_PF7_FUNC_FMC_NREG 0x570d
#define STM32F4_PF7_FUNC_EVENTOUT 0x5710
#define STM32F4_PF7_FUNC_ANALOG 0x5711

#define STM32F4_PF8_FUNC_GPIO 0x5800
#define STM32F4_PF8_FUNC_SPI5_MISO 0x5806
#define STM32F4_PF8_FUNC_SAI1_SCK_B 0x5807
#define STM32F4_PF8_FUNC_TIM13_CH1 0x580a
#define STM32F469_PF8_FUNC_QUADSPI_BK1_IO0 0x580b
#define STM32F429_PF8_FUNC_FMC_NIOWR 0x580d
#define STM32F4_PF8_FUNC_EVENTOUT 0x5810
#define STM32F4_PF8_FUNC_ANALOG 0x5811

#define STM32F4_PF9_FUNC_GPIO 0x5900
#define STM32F4_PF9_FUNC_SPI5_MOSI 0x5906
#define STM32F4_PF9_FUNC_SAI1_FS_B 0x5907
#define STM32F4_PF9_FUNC_TIM14_CH1 0x590a
#define STM32F469_PF9_FUNC_QUADSPI_BK1_IO1 0x590b
#define STM32F429_PF9_FUNC_FMC_CD 0x590d
#define STM32F4_PF9_FUNC_EVENTOUT 0x5910
#define STM32F4_PF9_FUNC_ANALOG 0x5911

#define STM32F4_PF10_FUNC_GPIO 0x5a00
#define STM32F469_PF10_FUNC_QUADSPI_CLK 0x5a0a
#define STM32F429_PF10_FUNC_FMC_INTR 0x5a0d
#define STM32F4_PF10_FUNC_DCMI_D11 0x5a0e
#define STM32F4_PF10_FUNC_LCD_DE 0x5a0f
#define STM32F4_PF10_FUNC_EVENTOUT 0x5a10
#define STM32F4_PF10_FUNC_ANALOG 0x5a11

#define STM32F4_PF11_FUNC_GPIO 0x5b00
#define STM32F4_PF11_FUNC_SPI5_MOSI 0x5b06
#define STM32F4_PF11_FUNC_FMC_SDNRAS 0x5b0d
#define STM32F4_PF11_FUNC_DCMI_D12 0x5b0e
#define STM32F4_PF11_FUNC_EVENTOUT 0x5b10
#define STM32F4_PF11_FUNC_ANALOG 0x5b11

#define STM32F4_PF12_FUNC_GPIO 0x5c00
#define STM32F4_PF12_FUNC_FMC_A6 0x5c0d
#define STM32F4_PF12_FUNC_EVENTOUT 0x5c10
#define STM32F4_PF12_FUNC_ANALOG 0x5c11

#define STM32F4_PF13_FUNC_GPIO 0x5d00
#define STM32F4_PF13_FUNC_FMC_A7 0x5d0d
#define STM32F4_PF13_FUNC_EVENTOUT 0x5d10
#define STM32F4_PF13_FUNC_ANALOG 0x5d11

#define STM32F4_PF14_FUNC_GPIO 0x5e00
#define STM32F4_PF14_FUNC_FMC_A8 0x5e0d
#define STM32F4_PF14_FUNC_EVENTOUT 0x5e10
#define STM32F4_PF14_FUNC_ANALOG 0x5e11

#define STM32F4_PF15_FUNC_GPIO 0x5f00
#define STM32F4_PF15_FUNC_FMC_A9 0x5f0d
#define STM32F4_PF15_FUNC_EVENTOUT 0x5f10
#define STM32F4_PF15_FUNC_ANALOG 0x5f11



#define STM32F4_PG0_FUNC_GPIO 0x6000
#define STM32F4_PG0_FUNC_FMC_A10 0x600d
#define STM32F4_PG0_FUNC_EVENTOUT 0x6010
#define STM32F4_PG0_FUNC_ANALOG 0x6011

#define STM32F4_PG1_FUNC_GPIO 0x6100
#define STM32F4_PG1_FUNC_FMC_A11 0x610d
#define STM32F4_PG1_FUNC_EVENTOUT 0x6110
#define STM32F4_PG1_FUNC_ANALOG 0x6111

